Documents/Трансфер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Трансфер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Трансферы</xr:Item>
				<xr:Item>AccumulationRegister.БюджетыФутбольныхКлубов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлубПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФутбольныеКлубы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлубПокупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФутбольныеКлубы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Футболист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Футболисты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предложение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветноеПредложение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПереговоров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПереговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаетсяДействиеИгры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияПереговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстПредложения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ТрансфернаяСтоимость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТрансфернаяСтоимость</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТрансфернаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Футболист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Футболисты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/БюджетыФутбольныхКлубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетыФутбольныхКлубов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщийБюджет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрансферныйБюджет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФутбольныйКлуб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФутбольныеКлубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусПереговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусПереговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветноеПредложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Трансфер/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьТрансферныйБюджет();
	
	ЗаполнитьТекущуюТрансфернуюСтоимость();	
	
	ВывестиФотографию();
	
	УстановитьВидимостьЭлементовФормы();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПереговоровПродажаПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьПредложение(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОжидаетсяДействиеИгры = Истина;
	СтрокаИстории = Объект.ИсторияПереговоров.Добавить();
	СтрокаИстории.ТекстПредложения = Объект.Предложение; 
	
	ОтправитьПредложениеНаСервере();
	УстановитьВидимостьЭлементовФормы(); 
	ОбновитьТрансферныйБюджет();
	
	Модифицированность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьПереговоры(Команда)   
	
	ПрекратитьПереговорыНаСервере();  

	УстановитьВидимостьЭлементовФормы(); 
	ОбновитьТрансферныйБюджет();
	
	Модифицированность = Ложь;   
	
	Оповестить("ОбновитьПереговоры");

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтвет(Команда)  
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОтправитьОтветНаСервере();  
	
	УстановитьВидимостьЭлементовФормы(); 
	ОбновитьТрансферныйБюджет();
	
	Модифицированность = Ложь;   
	
	Оповестить("ОбновитьПереговоры");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитьПредложениеНаСервере() 
	
	Объект.Дата = Константы.ИгроваяДата.Получить();
	
	Значение = РеквизитФормыВЗначение("Объект");
	Значение.Записать(РежимЗаписиДокумента.Проведение); 
	ЗначениеВРеквизитФормы(Значение, "Объект");
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущуюТрансфернуюСтоимость()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТрансфернаяСтоимостьСрезПоследних.ТрансфернаяСтоимость КАК ТрансфернаяСтоимость
	                      |ИЗ
	                      |	РегистрСведений.ТрансфернаяСтоимость.СрезПоследних(, Футболист = &Футболист) КАК ТрансфернаяСтоимостьСрезПоследних");
	Запрос.УстановитьПараметр("Футболист", Объект.Футболист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТрансфернаяСтоимость = Выборка.ТрансфернаяСтоимость;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ФутбольныйКлубМенеджера = Константы.ФутбольныйКлубМенеджера.Получить();
	
	Если Объект.КлубПокупатель = ФутбольныйКлубМенеджера Тогда
		
		Элементы.ГруппаПродажа.Видимость = Ложь; 
		
		Отклонено = Объект.СтатусПереговоров = Перечисления.СтатусПереговоров.Отклонено;
		ОжидаетсяДействиеИгрока = Не Объект.ОжидаетсяДействиеИгры И Не Отклонено;
		
		Элементы.Предложение.ТолькоПросмотр = Не ОжидаетсяДействиеИгрока;
		Элементы.ОтправитьПредложение.Видимость = ОжидаетсяДействиеИгрока; 
		
		Элементы.ДекорацияПодсказка.Видимость = Объект.ОжидаетсяДействиеИгры; 
		
		Элементы.ОтветноеПредложение.Видимость = Объект.СтатусПереговоров = Перечисления.СтатусПереговоров.ОтветноеПредложение;	
		Элементы.ПрекратитьПереговоры.Видимость = Объект.СтатусПереговоров = Перечисления.СтатусПереговоров.ОтветноеПредложение И Не Объект.ОжидаетсяДействиеИгры;	
		
	ИначеЕсли Объект.КлубПродавец = ФутбольныйКлубМенеджера Тогда	
		
		Элементы.ГруппаПокупка.Видимость = Ложь; 
		
		Если Не Объект.ОжидаетсяДействиеИгры Тогда
			ТолькоПросмотр = Истина; 
			Элементы.ОтправитьОтвет.Видимость = Ложь;
		КонецЕсли;  
		
		Элементы.ОтветноеПредложениеПродажа.Видимость = Объект.СтатусПереговоров = Перечисления.СтатусПереговоров.ОтветноеПредложение; 
		
	Иначе    
		
		Элементы.ГруппаПродажа.Видимость = Ложь;
		
		ТолькоПросмотр = Истина; 
		Элементы.ТрансферныйБюджет.Видимость = Ложь;	
		Элементы.ОтправитьПредложение.Видимость = Ложь;	
		Элементы.ПрекратитьПереговоры.Видимость = Ложь;	
		Элементы.ДекорацияПодсказка.Видимость = Ложь; 

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТрансферныйБюджет()

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БюджетыФутбольныхКлубовОстатки.ТрансферныйБюджетОстаток КАК ТрансферныйБюджетОстаток
	                      |ИЗ
	                      |	РегистрНакопления.БюджетыФутбольныхКлубов.Остатки(, ФутбольныйКлуб = &ФутбольныйКлуб) КАК БюджетыФутбольныхКлубовОстатки");
	Запрос.УстановитьПараметр("ФутбольныйКлуб", Константы.ФутбольныйКлубМенеджера.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ТрансферныйБюджет = Выборка.ТрансферныйБюджетОстаток;
	Иначе
		ТрансферныйБюджет = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрекратитьПереговорыНаСервере(ТекстОтвета = "")
	
	Объект.Дата = Константы.ИгроваяДата.Получить();
	Объект.СтатусПереговоров = Перечисления.СтатусПереговоров.Отклонено;    
	Объект.ИсторияПереговоров[Объект.ИсторияПереговоров.Количество() - 1].ТекстОтвета = ТекстОтвета;

	Значение = РеквизитФормыВЗначение("Объект");
	Значение.Записать(РежимЗаписиДокумента.Проведение); 
	ЗначениеВРеквизитФормы(Значение, "Объект");
			
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтветНаСервере()
	
	Если Не Трансферы.ТрансферТехническиВозможен(Объект.Футболист) Тогда
		ТекстОтвета = НСтр("ru = 'Мы не можем остаться без футболистов. Трансфер невозможен.'");
		ПрекратитьПереговорыНаСервере(ТекстОтвета);
	КонецЕсли;
	
	Объект.Дата = Константы.ИгроваяДата.Получить();
	Объект.ОжидаетсяДействиеИгры = Ложь;
	Объект.ИсторияПереговоров[Объект.ИсторияПереговоров.Количество() - 1].ТекстОтвета = 
		Трансферы.ТекстОтветаПереговоров(Объект.СтатусПереговоров, Объект.ОтветноеПредложение);

	Значение = РеквизитФормыВЗначение("Объект");
	Значение.Записать(РежимЗаписиДокумента.Проведение); 
	ЗначениеВРеквизитФормы(Значение, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ВывестиФотографию()

	АдресФотографии = ПолучитьНавигационнуюСсылку(Объект.Футболист, "Фотография"); 

КонецПроцедуры

#КонецОбласти
